openfoam2206/tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync         false;

writeCyclicMatch  false;

patches
(
    {
        name inlet;

        patchInfo
        {
            type patch;
        }

        constructFrom set;
        set inlet;
    }
    {
        name outlet;

        patchInfo
        {
            type patch;
        }

        constructFrom set;
        set outlet;
    }
);


// ************************************************************************* //
